Community-PIO-CH32V/platform-ch32v/misc/svd/CH32X035xx.svd
      </registers>
    </peripheral>   
    <peripheral>
      <name>GPIOA</name>
      <description>General purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40010800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGLR</name>
          <displayName>CFGLR</displayName>
          <description>Port configuration register low
          (GPIOn_CFGLR)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x44444444</resetValue>
          <fields>
            <field>
              <name>MODE0</name>
              <description>Port n.0 mode bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF0</name>
              <description>Port n.0 configuration
              bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>Port n.1 mode bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF1</name>
              <description>Port n.1 configuration
              bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>Port n.2 mode bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF2</name>
              <description>Port n.2 configuration
              bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE3</name>
              <description>Port n.3 mode bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF3</name>
              <description>Port n.3 configuration
              bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE4</name>
              <description>Port n.4 mode bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF4</name>
              <description>Port n.4 configuration
              bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE5</name>
              <description>Port n.5 mode bits</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF5</name>
              <description>Port n.5 configuration
              bits</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE6</name>
              <description>Port n.6 mode bits</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF6</name>
              <description>Port n.6 configuration
              bits</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE7</name>
              <description>Port n.7 mode bits</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF7</name>
              <description>Port n.7 configuration
              bits</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGHR</name>
          <displayName>CFGHR</displayName>
          <description>Port configuration register high
          (GPIOn_CFGHR)</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x44444444</resetValue>
          <fields>
            <field>
              <name>MODE8</name>
              <description>Port n.8 mode bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF8</name>
              <description>Port n.8 configuration
              bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE9</name>
              <description>Port n.9 mode bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF9</name>
              <description>Port n.9 configuration
              bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE10</name>
              <description>Port n.10 mode bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF10</name>
              <description>Port n.10 configuration
              bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE11</name>
              <description>Port n.11 mode bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF11</name>
              <description>Port n.11 configuration
              bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE12</name>
              <description>Port n.12 mode bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF12</name>
              <description>Port n.12 configuration
              bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE13</name>
              <description>Port n.13 mode bits</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF13</name>
              <description>Port n.13 configuration
              bits</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE14</name>
              <description>Port n.14 mode bits</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF14</name>
              <description>Port n.14 configuration
              bits</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>MODE15</name>
              <description>Port n.15 mode bits</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>CNF15</name>
              <description>Port n.15 configuration
              bits</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INDR</name>
          <displayName>INDR</displayName>
          <description>Port input data register
          (GPIOn_INDR)</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDR0</name>
              <description>Port input data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR1</name>
              <description>Port input data</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR2</name>
              <description>Port input data</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR3</name>
              <description>Port input data</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR4</name>
              <description>Port input data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR5</name>
              <description>Port input data</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR6</name>
              <description>Port input data</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR7</name>
              <description>Port input data</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR8</name>
              <description>Port input data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR9</name>
              <description>Port input data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR10</name>
              <description>Port input data</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR11</name>
              <description>Port input data</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR12</name>
              <description>Port input data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR13</name>
              <description>Port input data</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR14</name>
              <description>Port input data</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
            <field>
              <name>IDR15</name>
              <description>Port input data</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>IDR16</name>
              <description>Port input data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>IDR17</name>
              <description>Port input data</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>IDR18</name>
              <description>Port input data</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>IDR19</name>
              <description>Port input data</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>IDR20</name>
              <description>Port input data</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>IDR21</name>
              <description>Port input data</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>IDR22</name>
              <description>Port input data</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
			<field>
              <name>IDR23</name>
              <description>Port input data</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTDR</name>
          <displayName>OUTDR</displayName>
          <description>Port output data register
          (GPIOn_OUTDR)</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ODR0</name>
              <description>Port output data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR1</name>
              <description>Port output data</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR2</name>
              <description>Port output data</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR3</name>
              <description>Port output data</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR4</name>
              <description>Port output data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR5</name>
              <description>Port output data</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR6</name>
              <description>Port output data</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR7</name>
              <description>Port output data</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR8</name>
              <description>Port output data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR9</name>
              <description>Port output data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR10</name>
              <description>Port output data</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR11</name>
              <description>Port output data</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR12</name>
              <description>Port output data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR13</name>
              <description>Port output data</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR14</name>
              <description>Port output data</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
            <field>
              <name>ODR15</name>
              <description>Port output data</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>ODR16</name>
              <description>Port output data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>ODR17</name>
              <description>Port output data</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>ODR18</name>
              <description>Port output data</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>ODR19</name>
              <description>Port output data</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>ODR20</name>
              <description>Port output data</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>ODR21</name>
              <description>Port output data</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>ODR22</name>
              <description>Port output data</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
			<field>
              <name>ODR23</name>
              <description>Port output data</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
			  <access>read-write</access>
            </field>
          </fields>
        </register>
