Community-PIO-CH32V/platform-ch32v/misc/svd/CH32X035xx.svd
        <register>
          <name>ISQR</name>
          <displayName>ISQR</displayName>
          <description>injected sequence register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JL</name>
              <description>Injected sequence length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>JSQ4</name>
              <description>4th conversion in injected
              sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ3</name>
              <description>3rd conversion in injected
              sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ2</name>
              <description>2nd conversion in injected
              sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ1</name>
              <description>1st conversion in injected
              sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR1_CHGOFFSET</name>
          <displayName>IDATAR1_CHGOFFSET</displayName>
          <description>injected data register x_Charge data offset for injected channel x/TKEYx_CHGOFFSET</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA0_7_TKCGOFFSET</name>
              <description>Injected data_Touch key charge data offset for injected channel x</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>JDATA8_15</name>
              <description>Injected data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR2</name>
          <displayName>IDATAR2</displayName>
          <description>injected data register x</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR3</name>
          <displayName>IDATAR3</displayName>
          <description>injected data register x</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDATAR4</name>
          <displayName>IDATAR4</displayName>
          <description>injected data register x</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>		
        <register>
          <name>RDATAR_DR</name>
          <displayName>RDATAR_DR</displayName>
          <description>regular data register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA0_7</name>
              <description>Regular data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
			<field>
              <name>DATA8_15</name>
              <description>Regular data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
			<field>
              <name>ADC2DATA</name>
              <description>converter data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>			
          </fields>
        </register>
        <register>
          <name>ACT_DCG</name>
          <displayName>ACT_DCG</displayName>
          <description>start and discharge time register</description>
          <addressOffset>0x4C</addressOffset>
		  <alternateRegister>RDATAR_DR</alternateRegister>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TKACT_DCG</name>
              <description>Touch key start and discharge time register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>			
          </fields>
        </register>				
        <register>
          <name>CTLR3</name>
          <displayName>CTLR3</displayName>
          <description>ADC control register 3</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
		      <field>
                <name>AWD3_RES</name>
                <description>Analog Watchdog 3 compares the results</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
		      <field>
                <name>AWD2_RES</name>
                <description>Analog Watchdog 2 compares the results</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>AWD1_RES</name>
                <description>Analog Watchdog 1 compares the results</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
              </field>			  
              <field>
                <name>AWD0_RES</name>
                <description>Analog Watchdog 0 compares the results</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            <field>
              <name>AWD3_RST_EN</name>
              <description>watchdog 3 output reset enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD2_RST_EN</name>
              <description>watchdog 2 output reset enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD1_RST_EN</name>
              <description>watchdog 1 output reset enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD0_RST_EN</name>
              <description>watchdog 0 output reset enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD_SCAN</name>
              <description>amalog watchdog scanning enabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK_DIV</name>
              <description>frequency division coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTR1</name>
          <displayName>WDTR1</displayName>
          <description>ADC watchdog 1 threshold register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>HTR1</name>
              <description>amalog watchdog high threshold setting value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>LTR1</name>
              <description>amalog watchdog low threshold setting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTR2</name>
          <displayName>WDTR2</displayName>
          <description>ADC watchdog 2 threshold register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>HTR2</name>
              <description>amalog watchdog high threshold setting value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>LTR2</name>
              <description>amalog watchdog low threshold setting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTR3</name>
          <displayName>WDTR3</displayName>
          <description>ADC watchdog 3 threshold register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>HTR3</name>
              <description>amalog watchdog high threshold setting value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>LTR3</name>
              <description>amalog watchdog low threshold setting value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
