Community-PIO-CH32V/platform-ch32v/misc/svd/CH32X035xx.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>AWU</name>
      <description> AWU configuration</description>
      <groupName>AWU</groupName>
      <baseAddress>0x40026400</baseAddress>
      <interrupt>
        <name>AWU</name>
        <description>AWU global interrupt</description>
        <value>21</value>
      </interrupt>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>R16_AWU_CSR</name>
          <displayName>R16_AWU_CSR</displayName>
          <description>Status Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>AWUEN</name>
              <description>AWU Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R16_AWU_WR</name>
          <displayName>R16_AWU_WR</displayName>
          <description>AWU Window register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
          <resetValue>0x003F</resetValue>
          <fields>
            <field>
              <name>AWU_APR</name>
              <description>AWU_APR value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R16_AWU_PSC</name>
          <displayName>R16_AWU_PSC</displayName>
          <description>R16_AWU_PSC</description>
          <addressOffset>0x8</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>AWU_TBR</name>
              <description>AWU_TBR value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>OPA</name>
      <description> OPA configuration</description>
      <groupName>OPA</groupName>
      <baseAddress>0x40026000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <displayName>CFGR1</displayName>
          <description>OPA Configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <resetValue>0x0080</resetValue>
          <fields>
            <field>
              <name>POLL_EN1</name>
              <description>POLL_EN1 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
              <name>POLL_EN2</name>
              <description>POLL_EN2 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKIN_EN1</name>
              <description>BKIN_EN1 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
              <name>BKIN_EN2</name>
              <description>BKIN_EN2 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_EN1</name>
              <description>RST_EN1 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
              <name>RST_EN2</name>
              <description>RST_EN2 Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKIN_SEL</name>
              <description>BKIN_SEL select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLL_LOCK</name>
              <description>POLL_LOCK select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE_OUT1</name>
              <description>IE_OUT1 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
              <name>IE_OUT2</name>
              <description>IE_OUT2 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE_CNT</name>
              <description>IE_CNT Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMI_EN</name>
              <description>NMI_EN Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_OUT1</name>
              <description>IF_OUT1 Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_OUT2</name>
              <description>IF_OUT2 Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IF_CNT</name>
              <description>IF_CNT Configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
		<register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>OPA Configuration register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>POLL_VLU</name>
              <description>POLL_VLU Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>            
            <field>
              <name>POLL1_NUM</name>
              <description>POLL1_NUM Configuration</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>POLL2_NUM</name>
              <description>POLL2_NUM Configuration</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTLR1</name>
          <displayName>CTLR1</displayName>
          <description>OPA Control1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x81D801D8</resetValue>
          <fields>
            <field>
              <name>EN1</name>
              <description>OPA1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>OPA1 mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL1</name>
              <description>Input select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FB_EN1</name>
              <description>res inside enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL1</name>
              <description>output select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>

            <field>
              <name>EN2</name>
              <description>OPA2 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>OPA2 mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL2</name>
              <description>Input select</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FB_EN2</name>
              <description>res inside enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL2</name>
              <description>output select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>

            <field>
              <name>OPA_LOCK</name>
              <description>OPA_LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CTLR2</name>
          <displayName>CTLR2</displayName>
          <description>OPA Control2 register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>EN1</name>
              <description>CMP1 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>CMP1 OUT Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL1</name>
              <description>CMP1 IN_N Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL1</name>
              <description>CMP1 IN_P Selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
            <name>HYEN1</name>
            <description>CMP1 hysteresis comparator switch</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
			</field>
			<field>
              <name>EN2</name>
              <description>CMP2 Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>CMP2 OUT Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL2</name>
              <description>CMP2 IN_N Selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL2</name>
              <description>CMP2 IN_P Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
            <name>HYEN2</name>
            <description>CMP2 hysteresis comparator switch</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
			</field>
            <field>
              <name>EN3</name>
              <description>CMP3 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE3</name>
              <description>CMP3 OUT Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NSEL3</name>
              <description>CMP3 IN_N Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL3</name>
              <description>CMP3 IN_P Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
			<field>
            <name>HYEN3</name>
            <description>CMP3 hysteresis comparator switch</description>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
            <access>read-write</access>
			</field>
            <field>
              <name>CMP_LOCK</name>
              <description>CMP_LOCK</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>OPA_KEY</name>
          <displayName>OPA_KEY</displayName>
          <description>OPA unlock key register</description>
          <addressOffset>0x0c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPA_KEY</name>
              <description>OPA_KEY value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>CMP_KEY</name>
          <displayName>CMP_KEY</displayName>
          <description>CMP unlock key register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP_KEY</name>
              <description>CMP_KEY value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>

        <register>
          <name>POLL_KEY</name>
          <displayName>POLL_KEY</displayName>
          <description>POLL unlock key register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>POLL_KEY</name>
              <description>POLL_KEY value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
